In [157]:
import pandas as pd
import math

In [158]:
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [201]:
df=pd.DataFrame(exam_data,index=labels)

In [202]:
df

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5
d         3      James      no    NaN
e         2      Emily      no    9.0
f         3    Michael     yes   20.0
g         1    Matthew     yes   14.5
h         1      Laura      no    NaN
i         2      Kevin      no    8.0
j         1      Jonas     yes   19.0

In [184]:
s=df.loc[df['score'].isna()].index.tolist()

In [185]:
for i in s:
    df.loc[i,'score']=0

In [207]:
s={'name' :"Suresh",'score': 15.5, 'attempts': 1, 'qualify': "yes"}

In [208]:
df.loc['k']=s

In [209]:
df

   attempts       name qualify  score
a         1  Anastasia    True   12.5
b         3       Dima   False    9.0
c         2  Katherine    True   16.5
d         3      James   False    NaN
e         2      Emily   False    9.0
f         3    Michael    True   20.0
g         1    Matthew    True   14.5
h         1      Laura   False    NaN
i         2      Kevin   False    8.0
j         1      Jonas    True   19.0
k         1     Suresh     yes   15.5

In [192]:
df.sort_values(by=['score'],ascending=False)

   attempts       name qualify  score
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0
c         2  Katherine     yes   16.5
k         1     Suresh     yes   15.5
g         1    Matthew     yes   14.5
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
e         2      Emily      no    9.0
i         2      Kevin      no    8.0
d         3      James      no    0.0
h         1      Laura      no    0.0

In [204]:
df['qualify']=df['qualify'].replace("yes","True").replace("no",False)

In [198]:
df

   attempts       name qualify  score
a         1  Anastasia    True   12.5
b         3       Dima   False    9.0
c         2  Katherine    True   16.5
d         3      James   False    0.0
e         2      Emily   False    9.0
f         3    Michael    True   20.0
g         1    Matthew    True   14.5
h         1      Laura   False    0.0
i         2      Kevin   False    8.0
j         1      Jonas    True   19.0
k         1     Suresh    True   15.5

In [199]:
df['name']="Suresh"

In [210]:
df['name']=="Suresh"

a    False
b    False
c    False
d    False
e    False
f    False
g    False
h    False
i    False
j    False
k     True
Name: name, dtype: bool

In [213]:
r=df.loc[df['name']=="James"].index.tolist()

In [214]:
df.loc[r,'name']="Suresh"

In [215]:
df

   attempts       name qualify  score
a         1  Anastasia    True   12.5
b         3       Dima   False    9.0
c         2  Katherine    True   16.5
d         3     Suresh   False    NaN
e         2      Emily   False    9.0
f         3    Michael    True   20.0
g         1    Matthew    True   14.5
h         1      Laura   False    NaN
i         2      Kevin   False    8.0
j         1      Jonas    True   19.0
k         1     Suresh     yes   15.5

In [216]:
df.pop('attempts')

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
k    1
Name: attempts, dtype: int64

In [217]:
df

        name qualify  score
a  Anastasia    True   12.5
b       Dima   False    9.0
c  Katherine    True   16.5
d     Suresh   False    NaN
e      Emily   False    9.0
f    Michael    True   20.0
g    Matthew    True   14.5
h      Laura   False    NaN
i      Kevin   False    8.0
j      Jonas    True   19.0
k     Suresh     yes   15.5

In [229]:
d={'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2,1,2]}

In [221]:
df.shape

(11, 3)

In [223]:
df.loc['attempts']=d

ValueError: cannot set a row with mismatched columns

In [230]:
df['attempts']=d['attempts']

In [231]:
df

        name qualify  score  attempts
a  Anastasia    True   12.5         1
b       Dima   False    9.0         3
c  Katherine    True   16.5         2
d     Suresh   False    NaN         3
e      Emily   False    9.0         2
f    Michael    True   20.0         3
g    Matthew    True   14.5         1
h      Laura   False    NaN         1
i      Kevin   False    8.0         2
j      Jonas    True   19.0         1
k     Suresh     yes   15.5         2

In [232]:
for i in df:
    print (i)

name
qualify
score
attempts

In [240]:
for index,row in df.iterrows():
    print(row['score'])

12.5
9.0
16.5
nan
9.0
20.0
14.5
nan
8.0
19.0
15.5

In [241]:
import os

In [245]:
os.path

In [247]:
os.chdir('C:\\Users\\elda.zenelaj\\Desktop\\WinPython-64bit-3.6.3.0Qt5\\scripts')

In [248]:
os.path

In [251]:
df1=pd.from_csv('IN vs Viper_07.08.2018.xlsx')

AttributeError: module 'pandas' has no attribute 'from_csv'

In [279]:
import xlrd

In [280]:
df1=pd.read_excel('IN vs Viper_07.08.2018.xlsx')

In [281]:
df1

,MSISDN,Entity A,Entity B,Mismatch Definition Description,Recurrence,VAS comment,CRM comment
0,355692709557,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
1,355699654399,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
2,355699838947,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
3,355692728129,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
4,355697828687,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
5,355699856158,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
6,355699933978,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
7,355692732898,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
8,355695394496,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
9,355698688158,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
10,355699856112,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
11,355699856024,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
12,355699838941,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
13,355699856050,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
14,355699933921,IN,VIPER,In viper_subs Not in_subs,1,NaN,NaN
15,355692743335,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
16,355699668737,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
17,355697914281,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
18,355699856066,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
19,355699863270,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
20,355692730452,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
21,355692748872,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
22,355694895999,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
23,355692747090,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
24,355697702466,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
25,355699838940,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
26,355699863237,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
27,355699863235,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
28,355696812156,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
29,355697657318,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
30,355697873446,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
31,355699863252,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
32,355675386681,IN,VIPER,In viper_subs Not in_subs,3,Deactive,Activate in IN
33,355693314160,IN,VIPER,In viper_subs Not in_subs,3,Deactive,Disconneted from Viper
34,355685585005,IN,VIPER,In viper_subs Not in_subs,4,Deactive,Activate in IN
35,355693355174,IN,VIPER,In viper_subs Not in_subs,6,Deactive,Activate in IN

In [289]:
df1.loc[df1['Recurrence ']==2]

,MSISDN,Entity A,Entity B,Mismatch Definition Description,Recurrence,VAS comment,CRM comment
15,355692743335,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
16,355699668737,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
17,355697914281,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
18,355699856066,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
19,355699863270,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
20,355692730452,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
21,355692748872,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
22,355694895999,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
23,355692747090,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
24,355697702466,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
25,355699838940,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
26,355699863237,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
27,355699863235,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
28,355696812156,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
29,355697657318,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
30,355697873446,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN
31,355699863252,IN,VIPER,In viper_subs Not in_subs,2,NaN,NaN

In [292]:
lista=[5,8,9,7]

In [293]:
df3=pd.DataFrame(lista)

In [297]:
df3[0].sum()

29

In [298]:
sum(lista)

29

In [300]:
s=1
for i in lista:
    s=s*i
print (s)

2520

In [303]:
max(lista)

9

In [304]:
min(lista)

5

In [305]:
lista= ['abc', 'xyz', 'aba', '1221']

In [306]:
lista

['abc', 'xyz', 'aba', '1221']

In [307]:
from collections import Counter

In [313]:
Counter(lista)

Counter({'1221': 1, 'aba': 1, 'abc': 1, 'xyz': 1})

In [320]:
s=0
for i in lista:
    if len(i) >=2:
            if i[0]==i[-1]:
                s=s+1
print (s)

2

In [321]:
lista=[(2, 5), (1, 2), (4, 4), (2, 3), (2, 1)]

In [333]:
def second_num(nr):
    return nr[1]
lista.sort(key=second_num)

In [334]:
lista

[(2, 1), (1, 2), (2, 3), (4, 4), (2, 5)]

In [425]:
lista=[1,5,7,9,4,5,2]
list1=[]
d=Counter(lista)
for i in d:
        list1.append(i)

In [426]:
list1

[1, 5, 7, 9, 4, 2]

In [365]:
list1=[1,5,8,9,7]
list2=[2,5,7]
lista=list1+list2

In [366]:
lista

[1, 5, 8, 9, 7, 2, 5, 7]

In [367]:
d=Counter(lista)

In [368]:
d

Counter({1: 1, 2: 1, 5: 2, 7: 2, 8: 1, 9: 1})

In [373]:
for i in d:
    if d[i]==2:
        break
    print (True)

True

In [414]:
def lists2(list1,list2):
    lista=list1+list2
    d=Counter(lista)
    for i in d:
        if d[i]==2:
            break
    return True

In [421]:
lis1=[1,8,6,9]
lis2=[4,3,4]

In [422]:
lists2(lis1,lis2)

True

In [423]:
for i in lis2:
    print (lis2.count(i))

2
1
2

In [424]:
Counter(lis2)

Counter({3: 1, 4: 2})

In [484]:
def rem_dupl(lista):
    liste=[]
    d=Counter(lista)
    for i in d:
          liste.append(i)
    return liste

In [485]:
lis1=[4,5,4,8,9,7,5]

In [486]:
rem_dupl(lis1)

[4, 5, 8, 9, 7]

In [487]:
def lists2(list1,list2):
    lista=rem_dupl(list1)+rem_dupl(list2)
    d=Counter(lista)
    for i in d:
        if d[i]==2:
            break
    print (True)

In [488]:
lista1=[7,5,8,7,4]
lista2=[2,9,3]

In [489]:
lists2(lista1,lista2)

True

In [490]:
lista=rem_dupl(list1)+rem_dupl(list2)

In [491]:
lista

[1, 5, 7, 9, 4, 2, 2, 5, 7]

In [493]:
rem_dupl(lista1)

[7, 5, 8, 4]